Catalogs/ПЛ_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_События</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ИсточникиСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРегламентнойПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ПериодичностьРегламентныхПроверок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодписки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ВидыУсловийУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ВидыУсловийУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПоИсточнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПЛ_ПериодичностьРегламентныхПроверок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ПериодичностьРегламентныхПроверок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Никогда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждуюНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазВДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаждыйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГибкоеРасписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_События/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список событий для указанного источника события
//
// Параметры
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип источника события
//    Источник - ЛюбаяСсылка - ссылка на источник события
//
// Возвращаемое значение: массив событий, либо Неопределено, если ни одного события не нашлось
//
Функция СобытияПоИсточнику(ТипИсточника, Источник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	События.Ссылка                                КАК Ссылка,
	|	События.ВидУсловийРегистрацииСобытия          КАК ВидУсловийРегистрацииСобытия,
	|	События.СхемаУсловийРегистрацииСобытия        КАК СхемаУсловийРегистрацииСобытия,
	|	События.НастройкиУсловийРегистрацииСобытия    КАК НастройкиУсловийРегистрацииСобытия
	|ИЗ
	|	Справочник.ПЛ_События КАК События
	|ГДЕ
	|	События.ИсточникСобытия = &ТипИсточника
	|	И События.Регистратор ПОДОБНО &Регистратор
	|	И НЕ События.ПометкаУдаления
	|	";
	
	ИмяОбъекта = Источник.Метаданные().Имя;
	Запрос.УстановитьПараметр("ТипИсточника", ТипИсточника);
	Запрос.УстановитьПараметр("Регистратор", ИмяОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Проверка условия
	ОтобранныеСобытия = Новый Массив;
	
	ВыборкаСобытий = РезультатЗапроса.Выбрать();
	Пока ВыборкаСобытий.Следующий() Цикл
		
		Если ВыборкаСобытий.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия Тогда
			
			ОтобранныеСобытия.Добавить(ВыборкаСобытий.Ссылка);
			
		ИначеЕсли ВыборкаСобытий.ВидУсловийРегистрацииСобытия = Перечисления.ПЛ_ВидыУсловийУведомлений.ОтборПоИсточнику Тогда
			
			АдресСхемыУсловий = ПоместитьВоВременноеХранилище(ВыборкаСобытий.СхемаУсловийРегистрацииСобытия.Получить(), Новый УникальныйИдентификатор);
			АдресНастроекУсловий = ПоместитьВоВременноеХранилище(ВыборкаСобытий.НастройкиУсловийРегистрацииСобытия.Получить(), Новый УникальныйИдентификатор);
			Если ПЛ_УведомленияОсобытиях.ПроверитьУсловие(ТипИсточника, Источник, АдресСхемыУсловий, АдресНастроекУсловий) Тогда
				ОтобранныеСобытия.Добавить(ВыборкаСобытий.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОтобранныеСобытия.Количество() Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОтобранныеСобытия;
	КонецЕсли;
	
КонецФункции

// Создает события по-умолчанию при первом запуске подсистемы и помещает их в группу "Преднастроенные"
//
Процедура ЗаполнитьПреднастроенныеСобытия() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокСобытий = СписокПреднастроенныхСобытий();
	
	Если СписокСобытий.Количество() Тогда
		
		ГруппаПреднастроенные = НайтиПоНаименованию(НСтр("ru = 'Преднастроенные'"), Истина);
		
		Если Не ЗначениеЗаполнено(ГруппаПреднастроенные) Тогда
			ГруппаПреднастроенные = Справочники.ПЛ_События.СоздатьГруппу();
			ГруппаПреднастроенные.Наименование = НСтр("ru = 'Преднастроенные'");
			ГруппаПреднастроенные.Записать();
			ГруппаПреднастроенные = ГруппаПреднастроенные.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого ПреднастроенноеСобытие из СписокСобытий Цикл
		
		Ссылка = НайтиПоНаименованию(ПреднастроенноеСобытие.Наименование, Истина);
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Попытка
				Объект = "";
				Выполнить("Объект = " + ПреднастроенноеСобытие.ПроцедураСоздания + "(""" + ПреднастроенноеСобытие.Наименование + """)");
				Объект.Родитель = ГруппаПреднастроенные;
				Объект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Формирует наименование задания для событий вида "Регламентная проверка"
//
// Параметры
//    НаименованиеСобытия - Строка - Наименование события, для которого формируется наименование задания
//
// Возвращаемое значение: наименование регламентного задания
//
Функция НаименованиеЗадания(НаименованиеСобытия) Экспорт
	
	НаименованиеЗадания = НСтр("ru = 'Уведомления по регламентной проверке: %1'");
	Возврат СтрЗаменить(НаименованиеЗадания, "%1", СокрЛП(НаименованиеСобытия));
	
КонецФункции

// Возвращает Реквизиты
Функция РеквизитыСобытия(Ссылка) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ИсточникСобытия");
	СтруктураРеквизитов.Вставить("Регистратор");
	СтруктураРеквизитов.Вставить("КодПодписки");
	СтруктураРеквизитов.Вставить("РегламентноеЗадание");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсточникСобытия,
	|	Регистратор,
	|	КодПодписки,
	|	РегламентноеЗадание
	|ИЗ
	|	Справочник.ПЛ_События
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Создает и возвращает событие по регламентной проверке по переданному наименованию макета СКД
//
Функция СоздатьСобытиеРегламентнойПроверки(НаименованиеСобытия, НаименованиеМакета)
	
	Событие = СоздатьЭлемент();
	Событие.Наименование                        = НаименованиеСобытия;
	Событие.ИсточникСобытия                     = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка;
	Событие.ПериодичностьРегламентнойПроверки   = Перечисления.ПЛ_ПериодичностьРегламентныхПроверок.Никогда;
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДатаНачала = ТекущаяДата();
	Расписание.ВремяНачала = ТекущаяДата();
	
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ПЛ_УведомленияПоРегламентнымПроверкам);
	Задание.Использование = Истина;
	Задание.Наименование = НаименованиеЗадания(НаименованиеСобытия);
	Задание.Расписание = Расписание;
	Задание.Записать();
	
	Событие.РегламентноеЗадание                 = Задание.УникальныйИдентификатор;
	
	Схема = ПолучитьМакет(НаименованиеМакета);
	
	Событие.СхемаРегламентнойПроверки           = Новый ХранилищеЗначения(Схема);
	Событие.НастройкиРегламентнойПроверки       = Новый ХранилищеЗначения(Схема.НастройкиПоУмолчанию);
	
	Возврат Событие;
	
КонецФункции

// Возвращает список преднастроенных событий для поддерживаемых конфигураций
//
Функция СписокПреднастроенныхСобытий()
	
	ВерсияПодсистемыУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	СписокСобытий = Новый Массив;
	
	Если ВерсияПодсистемыУТ = "10" Тогда
		
		ОписаниеСобытия = Новый Структура;
		ОписаниеСобытия.Вставить("Наименование", НСтр("ru = 'Оплата по заказу'"));
		ОписаниеСобытия.Вставить("ПроцедураСоздания", "ОплатаПоЗаказуУТ10");
		СписокСобытий.Добавить(ОписаниеСобытия);
		
	ИначеЕсли ВерсияПодсистемыУТ = "11" Тогда
		
		ОписаниеСобытия = Новый Структура;
		ОписаниеСобытия.Вставить("Наименование", НСтр("ru = 'Оплата по графику'"));
		ОписаниеСобытия.Вставить("ПроцедураСоздания", "ОплатаПоГрафикуУТ11");
		СписокСобытий.Добавить(ОписаниеСобытия);
		
	КонецЕсли;
	
	Возврат СписокСобытий;
	
КонецФункции

// Создает преднастроенное событие "Оплата по графику"
//
Функция ОплатаПоЗаказуУТ10(Наименование) Экспорт
	
	Возврат СоздатьСобытиеРегламентнойПроверки(Наименование, "ОплатаПоЗаказуУТ10");
	
КонецФункции

// Создает преднастроенное событие "Оплата по графику"
//
Функция ОплатаПоГрафикуУТ11(Наименование) Экспорт
	
	Возврат СоздатьСобытиеРегламентнойПроверки(Наименование, "ОплатаПоГрафикуУТ11");
	
КонецФункции

#КонецЕсли
